In [3]:
import pandas as pd
import numpy as np

## Pandas Series

In [6]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [16]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [28]:
pd.Series(data = my_data, index = d.keys())

a    10
b    20
c    30
dtype: int64

In [30]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [32]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [34]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

## Pandas Data Frame

In [37]:
from numpy.random import randn

In [39]:
# Hold a consistent 

np.random.seed(101)

In [41]:
# Create a dataframe

df1 = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# Accessing the column 

df1['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
# Look at datatype

type(df1['X'])

pandas.core.series.Series

In [47]:
type(df1)

pandas.core.frame.DataFrame

In [53]:
# Accessing the multiple column

df1[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [59]:
# Adding the new column existing dataframe 

df1['P'] = randn(5)

In [67]:
df1

          W         X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826  0.390528
B  0.651118 -0.319318 -0.848077  0.605965  0.166905
C -2.018168  0.740122  0.528813 -0.589001  0.184502
D  0.188695 -0.758872 -0.933237  0.955057  0.807706
E  0.190794  1.978757  2.605967  0.683509  0.072960

In [71]:
# Remove the column temporary

df1.drop(columns = ['P'], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df1['new'] = df1['Y'] + df1['Z']
df1

          W         X         Y         Z         P       new
A  2.706850  0.628133  0.907969  0.503826  0.390528  1.411795
B  0.651118 -0.319318 -0.848077  0.605965  0.166905 -0.242112
C -2.018168  0.740122  0.528813 -0.589001  0.184502 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.807706  0.021819
E  0.190794  1.978757  2.605967  0.683509  0.072960  3.289476

In [77]:
# Remove the column permanently

df1.drop(columns = ['P'], axis =1, inplace = True)

In [79]:
df1

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [91]:
# Removing the rows of data frame

df1.drop('E', axis = 0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819

In [99]:
# Accessing the dataframe rows base on location label

np.array(df1.loc['A'])

array([2.70684984, 0.62813271, 0.90796945, 0.50382575, 1.4117952 ])

In [101]:
# Acessing the dataframe rows base on location index

np.array(df1.iloc[2])

array([-2.01816824,  0.74012206,  0.52881349, -0.58900053, -0.06018704])

In [105]:
# Acessing the  one specific data

df1.loc['B', 'Z']

0.6059653494949336

In [107]:
# Acessing the multiple specific rows and columns

df1.loc[['A', 'B'], ['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [113]:
df1.iloc[[0, 1], [2, 3]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [117]:
booldf = df1 > 0
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [119]:
df1[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [123]:
df1[df1 > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [127]:
df1[df1['W'] > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [131]:
df1[df1['X'] > 0]['X']

A    0.628133
C    0.740122
E    1.978757
Name: X, dtype: float64

In [133]:
df1[df1['X'] > 0 ][['Y', 'Z']]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [135]:
boolser = df1['X'] > 0
result = df1[boolser]
mycols = ['Y', 'Z']

result[mycols]

          Y         Z
A  0.907969  0.503826
C  0.528813 -0.589001
E  2.605967  0.683509

In [139]:
df1[(df1['X'] > 0 ) & (df1['Y'] > 1)]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [141]:
df1[(df1['X'] > 0 ) | (df1['Y'] > 1)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.411795
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [143]:
df1.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  1.411795
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
2     C -2.018168  0.740122  0.528813 -0.589001 -0.060187
3     D  0.188695 -0.758872 -0.933237  0.955057  0.021819
4     E  0.190794  1.978757  2.605967  0.683509  3.289476

In [145]:
newind = 'CA NY WY OR CO'.split()

In [149]:
df1['States'] = newind

df1

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  1.411795     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112     NY
C -2.018168  0.740122  0.528813 -0.589001 -0.060187     WY
D  0.188695 -0.758872 -0.933237  0.955057  0.021819     OR
E  0.190794  1.978757  2.605967  0.683509  3.289476     CO

In [153]:
df1.set_index('States')

               W         X         Y         Z       new
States
CA      2.706850  0.628133  0.907969  0.503826  1.411795
NY      0.651118 -0.319318 -0.848077  0.605965 -0.242112
WY     -2.018168  0.740122  0.528813 -0.589001 -0.060187
OR      0.188695 -0.758872 -0.933237  0.955057  0.021819
CO      0.190794  1.978757  2.605967  0.683509  3.289476

In [155]:
# Index multiLevel 

outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hire_index = list(zip(outside, inside))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [157]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [161]:
df2 = pd.DataFrame(randn(6, 2), hire_index, ['A', 'B'])

df2

             A         B
G1 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826
G2 1  2.154846 -0.610259
   2 -0.755325 -0.346419
   3  0.147027 -0.479448

In [165]:
df2.loc['G1']

          A         B
1 -1.136645  0.000366
2  1.025984 -0.156598
3 -0.031579  0.649826

In [167]:
df2.loc['G1'].loc[1]

A   -1.136645
B    0.000366
Name: 1, dtype: float64

In [169]:
df2.index.names = ['Groups', 'num']
df2

                   A         B
Groups num
G1     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826
G2     1    2.154846 -0.610259
       2   -0.755325 -0.346419
       3    0.147027 -0.479448

In [173]:
df2.loc['G2'].loc[2]['B']

-0.34641850351854453

In [175]:
df2.loc['G1'].loc[2]['A']

1.025984152081572

In [179]:
df2.xs(1, level = 'num')

               A         B
Groups
G1     -1.136645  0.000366
G2      2.154846 -0.610259

## Missing data with pandas

In [2]:
import pandas as pd
import numpy as np

In [4]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [6]:
df1 = pd.DataFrame(d)

In [8]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df1.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [12]:
# Remove the all rows if have null values

df1.dropna(
    axis = 0,
    inplace = False
)

     A    B  C
0  1.0  5.0  1

In [14]:
# Remove the all column if gave any null values

df1.dropna(
    axis = 1,
    inplace = False
)

   C
0  1
1  2
2  3

In [16]:
# Remove the null values if have two or more null data in the specific row

df1.dropna(
    axis = 0,
    thresh = 2
)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [20]:
# Use fillna() method

df1.fillna(value = 'Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [22]:
# Using missing values for mean value

df1['A'].fillna(
    value = df1['A'].mean()
)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group by data

In [37]:
company = ['Google', 'Google', 'MSFT', 'MSFT', 'FB', 'FB']
person = ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']
sales = [200, 120, 340, 124, 243, 350]

df2 = pd.DataFrame({
    'company':company,
    'person':person,
    'sales':sales
})

df2

  company   person  sales
0  Google      Sam    200
1  Google  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
# group by base of compnay column

df2.groupby('company').mean('sales')

         sales
company
FB       296.5
Google   160.0
MSFT     232.0

In [51]:
df2.groupby('company').sum('sales')

         sales
company
FB         593
Google     320
MSFT       464

In [65]:
df2.groupby('company')['sales'].std()

company
FB         75.660426
Google     56.568542
MSFT      152.735065
Name: sales, dtype: float64

In [67]:
df2.groupby('company').count()

         person  sales
company
FB            2      2
Google        2      2
MSFT          2      2

In [69]:
df2.groupby('company').max()

          person  sales
company
FB         Sarah    350
Google       Sam    200
MSFT     Vanessa    340

In [71]:
df2.groupby('company').min()

          person  sales
company
FB          Carl    243
Google   Charlie    120
MSFT         Amy    124

In [77]:
df2.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [79]:
df2.groupby('company').describe().transpose()

company              FB      Google        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [81]:
df2.groupby('company').describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64